**`teams/nomis-data-hub/rhel_7_9_ems`** terragrunt plan on `push` event [#17](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-data-hub-rhel-7-9-ems"
        name         = "nomis_data_hub_rhel_7_9_ems"
      ~ tags         = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-data-hub-rhel-7-9-ems" -> (known after apply)
      ~ date_created                     = "2023-03-29T14:25:26.088Z" -> (known after apply)
      ~ date_last_run                    = "2023-04-02T00:00:21.344Z" -> (known after apply)
      ~ date_next_run                    = "2023-05-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-03-29T14:25:26.088Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-data-hub-rhel-7-9-ems" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-data-hub-rhel-7-9-ems/0.0.2" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-data-hub-rhel-7-9-ems-0-0-2" -> (known after apply)
        name                             = "nomis_data_hub_rhel_7_9_ems"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-data-hub-rhel-7-9-ems/0.0.2" -> (known after apply)
      ~ date_created      = "2023-03-29T14:25:23.924Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-data-hub-rhel-7-9-ems/0.0.2" -> (known after apply)
        name              = "nomis_data_hub_rhel_7_9_ems"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Linux" -> (known after apply)
      ~ tags              = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ user_data_base64  = "" -> (known after apply)
      ~ version           = "0.0.2" -> "0.0.1" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      ~ component {
            # (1 unchanged attribute hidden)

          - parameter { # forces replacement
              - name  = "Branch" -> null
              - value = "feature/DSOS-1506/test_ami" -> null
            }
          + parameter { # forces replacement
              + name  = "Branch"
              + value = "main"
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-data-hub-rhel-7-9-ems-0-0-2" -> (known after apply)
      ~ date_created                  = "2023-03-29T14:25:23.511Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-data-hub-rhel-7-9-ems-0-0-2" -> (known after apply)
      ~ name                          = "nomis_data_hub_rhel_7_9_ems_0_0_2" -> "nomis_data_hub_rhel_7_9_ems_0_0_1" # forces replacement
      ~ resource_tags                 = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                       = "antonygowland-patch-1" -> "main"
          ~ "image-recipe"                 = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "infrastructure-configuration" = "nomis_data_hub_rhel_7_9_ems/0.0.2" -> "nomis_data_hub_rhel_7_9_ems/0.0.1"
          ~ "is-production"                = "false" -> "true"
          ~ "release-or-patch"             = "test" -> "release"
            # (7 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
